spec/support/vcr_cassettes/run_checkout_organizer_with_saved_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=5290&application_fee=690&currency=usd&description=Student%3A+Bob+Dole%2C+Tutor%3A+Bob+Dole%2C+Course%3A+Math+101%3A+Pre+Calculus%2C+School%3A+University+of+Georgia%2C+Appts%3A+2%2C+Time%28s%29%3A+[%22Friday%2C+March++4+at++7%3A00+AM%22%2C+%22Friday%2C+March++4+at++8%3A00+AM%22]&destination=acct_17kfh1GUzmmEZmmK
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer sk_test_4VObNRAiXCBixyd9lpO2sdeP
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.2.0 p0 (2014-12-25)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.1.13-boot2docker (root@11aafb97cfeb) (gcc version 4.9.2 (Debian
        4.9.2-10) ) #1 SMP Fri Nov 20 19:05:50 UTC 2015","hostname":"cb19fd816d4c"}'
      Content-Length:
      - '319'
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - nginx
      Date:
      - Wed, 02 Mar 2016 23:24:54 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '108'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_80kqm0FbITuwDZ
      Stripe-Version:
      - '2015-08-19'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "type": "invalid_request_error",
            "message": "Must provide source or customer."
          }
        }
    http_version: 
  recorded_at: Wed, 02 Mar 2016 23:24:54 GMT
recorded_with: VCR 3.0.1
